In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from pandasql import sqldf
pysqldf = lambda q: sqldf(q,globals())

In [2]:
os.getcwd()[11:]

'/Desktop/git_repos/TIL'

In [3]:
d_orig = pd.read_csv('../TIL_data/data_TAE.csv')
d = d_orig.copy()
d.head(2)

,region,TO_2021,TO_2020,TO_2019,TO_2018,cr_2021,cr_2020,cr_2019,cr_2018,cut_2021,cut_2020,cut_2019,cut_2018
0,서울,25,43,38,51,19.0,20.60,34.13,0,84.0,84.66,87.3,81.7
1,경기,82,57,39,64,15.4,17.07,21.18,0,85.0,81.67,82,80.7

In [4]:
li_cr_2018 = [26.80, 21.90, 39.00, 22.90, 40.40, 47.00,
              43.00, 0, 26.20, 25.40, 27.90, 23.20, 0, 33.20,
              25.50, 22.90, 14.60]

In [5]:
d['cr_2018'] = li_cr_2018
d.head(2)

,region,TO_2021,TO_2020,TO_2019,TO_2018,cr_2021,cr_2020,cr_2019,cr_2018,cut_2021,cut_2020,cut_2019,cut_2018
0,서울,25,43,38,51,19.0,20.60,34.13,26.8,84.0,84.66,87.3,81.7
1,경기,82,57,39,64,15.4,17.07,21.18,21.9,85.0,81.67,82,80.7